<?php

$name = "Igor";
$age = 23;
echo "Menya zovut $name", "<br>";
echo "Mne $age goda", "<br>";
$a = 5;

$s = 1/4*$a*sqrt(3);
echo $s;


echo "<br>----------------------------------------------------------------<br>";
$n = 10;
$sum=0;
for($i = 0; $i <= $n; $i++){
    echo $sum." + " . (1+$i*3) . " = ";
    $sum+=1+$i*3;
    echo $sum."<br>";
}
echo "summa = ".$sum. "<br>";

echo "<br>----------------------------------------------------------------<br>";

$n = 10;
$arr=array();
for($i = 1; $i <= $n; $i++){
    $arr[$i]=$i*$i;
}
print_r($arr);

echo "<br>----------------------------------------------------------------<br>";

$n=5;

if($n%2==0) {

    $n=$n/2;
}
else{
    $n=$n*3;
}

echo $n."<br>";

echo "<br>----------------------------------------------------------------<br>";

$a=4;

$b=30;

if(abs($a - $b) > 20){
    echo "Да <br>";
}else{
    echo "Нет <br>";
}



?>

//Cоздать массив из n чисел, каждый элемент которого равен квадрату своего номера.



